Tauser/Noisebot-v2/firmware/sdkconfig.defaults
# NoiseBot 2 — defaults (Waveshare ESP32-S3-DEV-KIT N32R16V:
# módulo WROOM-2, 32MB flash octal OPI + 16MB PSRAM octal, VDD_SPI 1.8V)

CONFIG_IDF_TARGET="esp32s3"

# Flash 32MB octal (OPI) — confirmar no S0.1 com a unidade em mãos
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM 16MB octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logs (dev; produção usa nível INFO e CONFIG_NB2_DEV_BUILD desligado — S1.3)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Coredump em flash (S1.3)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Watchdog (S1.5 endurece)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# OTA (S1.8): rollback por software via otadata, sem eFuse — a imagem nova
# só é confirmada depois que app_main chega saudável (nb_ota_shell). Sem
# BOOTLOADER_APP_ANTI_ROLLBACK (esse sim exige eFuse, fica pro gate de
# bancada explícito, ver sdkconfig.s1_8_secure.defaults).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Segurança — habilitados de verdade em S1.8 (exigem gestão de chaves; ver SECURITY.md):
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
